# ============================================================================
# Core Development Tools
# ============================================================================

# Version Control
brew "git"
brew "gh"              # GitHub CLI
brew "git-delta"       # Better git diff viewer

# Shell & Terminal
brew "zsh"
brew "powerlevel10k"
brew "starship"        # Alternative prompt (optional)

# Package Management
brew "stow"            # Dotfile symlink manager

# ============================================================================
# Rust Development Ecosystem
# ============================================================================

brew "rustup-init"     # Rust toolchain installer (if not using rustup.rs)

# Rust-powered CLI tools (modern replacements)
brew "bat"             # Better cat with syntax highlighting
brew "exa"             # Better ls (or use 'eza' - exa fork)
brew "fd"              # Better find
brew "ripgrep"         # Better grep (rg)
brew "sd"              # Better sed
brew "procs"           # Better ps
brew "bottom"          # Better top (btm)
brew "dust"            # Better du
brew "tokei"           # Code statistics
brew "hyperfine"       # Benchmarking tool
brew "zoxide"          # Better cd (z)

# Build tools
brew "cmake"
brew "pkg-config"

# ============================================================================
# Modern CLI Essentials
# ============================================================================

brew "fzf"             # Fuzzy finder
brew "jq"              # JSON processor
brew "yq"              # YAML processor
brew "tree"            # Directory tree viewer
brew "wget"
brew "curl"
brew "htop"            # Process viewer
brew "tmux"            # Terminal multiplexer
brew "neovim"          # Modern vim

# ============================================================================
# Languages & Runtimes
# ============================================================================

brew "node"            # Node.js
brew "python@3.12"
brew "go"              # Go language

# ============================================================================
# Security & Secrets
# ============================================================================

brew "gnupg"
brew "gopass"          # Password manager
brew "age"             # Modern encryption tool
brew "sops"            # Secrets management

# ============================================================================
# Productivity Tools
# ============================================================================

brew "autojump"        # Quick directory navigation
brew "tldr"            # Simplified man pages
brew "direnv"          # Per-directory environment variables

# ============================================================================
# GUI Applications (Casks)
# ============================================================================

cask "iterm2"          # Better terminal
cask "visual-studio-code"
cask "docker"          # Docker Desktop
cask "rectangle"       # Window management
cask "alfred"          # Spotlight replacement (optional)
cask "obsidian"        # Note-taking (optional)

# ============================================================================
# Fonts (for iTerm2 & terminal)
# ============================================================================

tap "homebrew/cask-fonts"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-hack-nerd-font"
